import React from "react";

export const AddIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="28.328" height="28.328" viewBox="0 0 28.328 28.328">
        <g id="Сгруппировать_78" data-name="Сгруппировать 78" transform="translate(-1026 -775.5)">
            <line id="Линия_24" data-name="Линия 24" x2="25.328" transform="translate(1027.5 789.664)" fill="none" stroke="#30b9d6" stroke-linecap="round" stroke-width="3" />
            <line id="Линия_25" data-name="Линия 25" x2="25.328" transform="translate(1040.164 777) rotate(90)" fill="none" stroke="#30b9d6" stroke-linecap="round" stroke-width="3" />
        </g>
    </svg>

}


export const ImageIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="30.685" height="30.685" viewBox="0 0 30.685 30.685">
        <path id="Icon_ionic-md-image" data-name="Icon ionic-md-image" d="M35.185,31.775V7.909A3.419,3.419,0,0,0,31.775,4.5H7.909A3.419,3.419,0,0,0,4.5,7.909V31.775a3.419,3.419,0,0,0,3.409,3.409H31.775A3.419,3.419,0,0,0,35.185,31.775ZM13.876,22.4l4.262,5.114L24.1,19.842l7.671,10.228H7.909Z" transform="translate(-4.5 -4.5)" fill="#30b9d6" />
    </svg>
}

export const PdfIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="23" height="30.37" viewBox="0 0 23 30.37">
        <path id="Icon_awesome-file-pdf" data-name="Icon awesome-file-pdf" d="M10.9,15.191a5.669,5.669,0,0,1-.12-2.782C11.278,12.409,11.23,14.6,10.9,15.191Zm-.1,2.8a27.242,27.242,0,0,1-1.7,3.719,22.2,22.2,0,0,1,3.767-1.3A7.7,7.7,0,0,1,10.793,17.991Zm-5.636,7.4c0,.047.791-.32,2.09-2.385A8.224,8.224,0,0,0,5.157,25.393Zm9.7-15.9H23V28.946a1.427,1.427,0,0,1-1.437,1.424H1.437A1.427,1.427,0,0,1,0,28.946V1.424A1.427,1.427,0,0,1,1.437,0H13.417V8.067A1.435,1.435,0,0,0,14.854,9.491Zm-.479,10.19a5.964,5.964,0,0,1-2.558-3.191,8.448,8.448,0,0,0,.371-3.808,1.5,1.5,0,0,0-2.863-.4c-.3,1.085-.024,2.616.485,4.567a55.462,55.462,0,0,1-2.444,5.089c-.006,0-.006.006-.012.006-1.623.824-4.408,2.64-3.264,4.033a1.869,1.869,0,0,0,1.288.593c1.072,0,2.138-1.068,3.66-3.666a34.4,34.4,0,0,1,4.732-1.376A9.143,9.143,0,0,0,17.6,22.682a1.534,1.534,0,0,0,1.18-2.574c-.833-.807-3.252-.575-4.408-.427ZM22.581,6.228,16.711.415A1.444,1.444,0,0,0,15.693,0h-.359V7.592H23V7.231A1.412,1.412,0,0,0,22.581,6.228ZM18.142,21.372c.246-.16-.15-.706-2.564-.534C17.8,21.775,18.142,21.372,18.142,21.372Z" fill="#30b9d6" />
    </svg>
}

export const FileIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="23.108" height="30.405" viewBox="0 0 23.108 30.405">
        <g id="Icon_ionic-ios-document" data-name="Icon ionic-ios-document" transform="translate(-7.313 -3.938)">
            <path id="Контур_119" data-name="Контур 119" d="M22.046,11.462h6.917a.376.376,0,0,0,.38-.38h0a2.25,2.25,0,0,0-.813-1.741l-5.8-4.834a2.441,2.441,0,0,0-1.566-.562h0a.561.561,0,0,0-.562.562v5.511A1.444,1.444,0,0,0,22.046,11.462Z" transform="translate(1.077 0.001)" fill="#30b9d6" />
            <path id="Контур_120" data-name="Контур 120" d="M19.7,10.018V3.938H9.745A2.44,2.44,0,0,0,7.313,6.37V31.91a2.44,2.44,0,0,0,2.432,2.432H27.988A2.44,2.44,0,0,0,30.42,31.91V13.439h-7.3A3.426,3.426,0,0,1,19.7,10.018Z" transform="translate(0 0)" fill="#30b9d6" />
        </g>
    </svg>

}