export enum ESpeciality {
    "Педиатр" = "Педиатр",
    "Терапевт" = "Терапевт",
    "Дерматолог" = "Дерматолог",
    "Психолог" = "Психолог",
    "Дефектолог" = "Дефектолог",
    "Логопед" = "Логопед",
    "Диетолог" = "Диетолог",
    "Аллерголог" = "Аллерголог",
}

// export enum EWorkExperience {
//     "Меньше 1 года" ,
//     "1 год",
//     "3 года" ,
//     "5 лет" ,
//     "больше 5 лет" ,
// }

export const workExperience = [
    "Меньше 1 года",
    "1 год",
    "3 года",
    "5 лет",
    "больше 5 лет",
];

export const MWorkExperience = {
    "Меньше 1 года": 364,
    "1 год": 365,
    "3 года": 1095,
    "5 лет": 1825,
    "больше лет": 2190,
};
