import React from "react";

type Props = {
    className?: string;
}

export const AddIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="28.328" height="28.328" viewBox="0 0 28.328 28.328">
        <g id="Сгруппировать_78" data-name="Сгруппировать 78" transform="translate(-1026 -775.5)">
            <line id="Линия_24" data-name="Линия 24" x2="25.328" transform="translate(1027.5 789.664)" fill="none" stroke="#30b9d6" strokeLinecap="round" strokeWidth="3" />
            <line id="Линия_25" data-name="Линия 25" x2="25.328" transform="translate(1040.164 777) rotate(90)" fill="none" stroke="#30b9d6" strokeLinecap="round" strokeWidth="3" />
        </g>
    </svg>
}

export const SupportIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="27" height="27" viewBox="0 0 27 27">
        <path id="Icon_ionic-ios-help-circle" d="M16.875,3.375a13.5,13.5,0,1,0,13.5,13.5A13.5,13.5,0,0,0,16.875,3.375ZM16.6,23.106a1.338,1.338,0,1,1,1.4-1.337A1.355,1.355,0,0,1,16.6,23.106Zm2.609-6.289c-1.129.656-1.512,1.136-1.512,1.967V19.3H15.441l-.019-.558a2.7,2.7,0,0,1,1.532-2.856c1.1-.656,1.558-1.071,1.558-1.876a1.575,1.575,0,0,0-1.746-1.4,1.642,1.642,0,0,0-1.739,1.6h-2.3c.045-2.09,1.59-3.57,4.2-3.57,2.434,0,4.108,1.35,4.108,3.291A3.177,3.177,0,0,1,19.205,16.817Z" transform="translate(-3.375 -3.375)" fill="#ccc"/>
    </svg>


}

export const LongArrowIcon: React.FC<Props> = (props) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="32.367" height="11.621" viewBox="0 0 32.367 11.621" {...props}>
        <g id="Icon_feather-arrow-right" data-name="Icon feather-arrow-right" transform="translate(14.617 -6.439)">
            <path id="Контур_334" data-name="Контур 334" d="M7.5,18H38.367" transform="translate(-21.367 -5.75)" fill="none" stroke="#30b9d6" strokeLinecap="round" strokeLinejoin="round" strokeWidth="1.5"/>
            <path id="Контур_335" data-name="Контур 335" d="M18,7.5l4.75,4.75L18,17" transform="translate(-5.75)" fill="none" stroke="#30b9d6" strokeLinecap="round" strokeLinejoin="round" strokeWidth="1.5"/>
        </g>
    </svg>;
}

export const Chevron = ({ fill, open, onClick, id }: { fill?: string, id?: string, open: boolean, onClick?: () => void }) => {
    return <svg id={id} xmlns="http://www.w3.org/2000/svg" onClick={onClick} width="12.621" height="22.243" viewBox="0 0 12.621 22.243" className={open ? "open" : ""}>
        <path id="Icon_feather-chevron-down" data-name="Icon feather-chevron-down" d="M0,9,9,0l9,9" transform="translate(11.121 2.121) rotate(90)" fill="none" stroke={fill ?? "#282828"} strokeLinecap="round" strokeLinejoin="round" strokeWidth="3" />
    </svg>
}

export const SendIcon: React.FC<Props> = (props) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="19.007" height="19.005" viewBox="0 0 19.007 19.005">
        <path id="Icon_ionic-ios-send" data-name="Icon ionic-ios-send" d="M22.911,4.545,4.738,12.466a.417.417,0,0,0,.015.757L9.669,16a.793.793,0,0,0,.906-.089l9.693-8.356c.064-.054.218-.158.277-.1s-.035.213-.089.277L12.07,17.179a.79.79,0,0,0-.079.946L15.2,23.277a.418.418,0,0,0,.752-.01L23.47,5.095A.417.417,0,0,0,22.911,4.545Z" transform="translate(-4.503 -4.503)" fill="#fff" />
    </svg>;
}

export const WarningIcon = () => {
    return <svg version="1.1" id="Capa_1" x="0px" y="0px"
                viewBox="0 0 512.001 512.001"  >
        <g>
            <g>
                <path d="M503.839,395.379l-195.7-338.962C297.257,37.569,277.766,26.315,256,26.315c-21.765,0-41.257,11.254-52.139,30.102
                L8.162,395.378c-10.883,18.85-10.883,41.356,0,60.205c10.883,18.849,30.373,30.102,52.139,30.102h391.398
                c21.765,0,41.256-11.254,52.14-30.101C514.722,436.734,514.722,414.228,503.839,395.379z M477.861,440.586
                c-5.461,9.458-15.241,15.104-26.162,15.104H60.301c-10.922,0-20.702-5.646-26.162-15.104c-5.46-9.458-5.46-20.75,0-30.208
                L229.84,71.416c5.46-9.458,15.24-15.104,26.161-15.104c10.92,0,20.701,5.646,26.161,15.104l195.7,338.962
                C483.321,419.836,483.321,431.128,477.861,440.586z"/>
            </g>
        </g>
        <g>
            <g>
                <rect x="241.001" y="176.01" width="29.996" height="149.982" />
            </g>
        </g>
        <g>
            <g>
                <path d="M256,355.99c-11.027,0-19.998,8.971-19.998,19.998s8.971,19.998,19.998,19.998c11.026,0,19.998-8.971,19.998-19.998
                S267.027,355.99,256,355.99z"/>
            </g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
        <g>
        </g>
    </svg>
}

export const AccountIcon : React.FC<Props> = ({className}) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="27" height="27" viewBox="0 0 27 27">
        <path id="Icon_ionic-md-person" data-name="Icon ionic-md-person" d="M18,18a6.75,6.75,0,1,0-6.75-6.75A6.77,6.77,0,0,0,18,18Zm0,3.375c-4.472,0-13.5,2.278-13.5,6.75V31.5h27V28.125C31.5,23.653,22.472,21.375,18,21.375Z" transform="translate(-4.5 -4.5)" fill="#ccc"/>
    </svg>
}

export const ConsultationIcon : React.FC<Props> = ({className}) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="27.574" height="27" viewBox="0 0 27.574 27">
        <path id="Icon_map-doctor" data-name="Icon map-doctor" d="M24.8,7.614H21.975v-3A3.853,3.853,0,0,0,18.13.72H10.885A3.852,3.852,0,0,0,7.039,4.611v3H4.21A3.426,3.426,0,0,0,.72,11.024V24.241A3.484,3.484,0,0,0,4.21,27.72H24.8a3.485,3.485,0,0,0,3.49-3.48V11.024A3.427,3.427,0,0,0,24.8,7.614Zm-15.467-3a1.659,1.659,0,0,1,1.548-1.594H18.13a1.66,1.66,0,0,1,1.548,1.594v3H9.337Zm11.489,15.64H16.805v4.021h-4.6V20.252H8.188v-4.6h4.021V11.635h4.6v4.021h4.021v4.6Z" transform="translate(-0.72 -0.72)" fill="#ccc"/>
    </svg>
}

export const ReviewsIcon : React.FC<Props> = ({className}) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="30.857" height="27" viewBox="0 0 30.857 27">
        <path id="Icon_awesome-comment-dots" data-name="Icon awesome-comment-dots" d="M15.429,2.25C6.907,2.25,0,7.861,0,14.786a11.126,11.126,0,0,0,3.435,7.877,15.332,15.332,0,0,1-3.3,5.774.479.479,0,0,0-.09.524.472.472,0,0,0,.44.289,13.783,13.783,0,0,0,8.474-3.1,18.38,18.38,0,0,0,6.473,1.169c8.522,0,15.429-5.611,15.429-12.536S23.95,2.25,15.429,2.25ZM7.714,16.714a1.929,1.929,0,1,1,1.929-1.929A1.927,1.927,0,0,1,7.714,16.714Zm7.714,0a1.929,1.929,0,1,1,1.929-1.929A1.926,1.926,0,0,1,15.429,16.714Zm7.714,0a1.929,1.929,0,1,1,1.929-1.929A1.926,1.926,0,0,1,23.143,16.714Z" transform="translate(0 -2.25)" fill="#ccc"/>
    </svg>;
}

export const NotificationIcon : React.FC<Props> = ({className}) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="22.493" height="28.132" viewBox="0 0 22.493 28.132">
        <g id="Icon_ionic-ios-notifications" data-name="Icon ionic-ios-notifications" transform="translate(-6.761 -3.93)">
            <path id="Контур_93" data-name="Контур 93" d="M17.993,32.063c2.187,0,3.382-1.547,3.382-3.727H14.6C14.6,30.516,15.8,32.063,17.993,32.063Z" fill="#ccc"/>
            <path id="Контур_94" data-name="Контур 94" d="M28.969,24.764c-1.083-1.427-3.213-2.264-3.213-8.655,0-6.56-2.9-9.2-5.6-9.83-.253-.063-.436-.148-.436-.415v-.2a1.716,1.716,0,1,0-3.431,0v.2c0,.26-.183.352-.436.415-2.707.64-5.6,3.27-5.6,9.83,0,6.391-2.13,7.221-3.213,8.655A1.4,1.4,0,0,0,8.163,27H27.858A1.4,1.4,0,0,0,28.969,24.764Z" fill="#ccc"/>
        </g>
    </svg>
}

export const LinkIcon : React.FC<Props> = ({ }) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36">
        <path id="Icon_awesome-link" data-name="Icon awesome-link" d="M22.965,13.035a10.682,10.682,0,0,1,.025,15.088l-.025.026L18.24,32.875A10.687,10.687,0,0,1,3.126,17.76l2.609-2.609a1.124,1.124,0,0,1,1.919.746A12.956,12.956,0,0,0,8.335,19.6a1.132,1.132,0,0,1-.266,1.168l-.92.92a5.063,5.063,0,1,0,7.114,7.2l4.725-4.724a5.061,5.061,0,0,0,0-7.16,5.267,5.267,0,0,0-.727-.6,1.128,1.128,0,0,1-.488-.886,2.8,2.8,0,0,1,.823-2.1l1.48-1.48a1.13,1.13,0,0,1,1.447-.122,10.721,10.721,0,0,1,1.443,1.209Zm9.909-9.91a10.7,10.7,0,0,0-15.114,0L13.035,7.85l-.025.026a10.69,10.69,0,0,0,1.468,16.3,1.13,1.13,0,0,0,1.447-.122l1.48-1.48a2.8,2.8,0,0,0,.823-2.1,1.128,1.128,0,0,0-.488-.886,5.267,5.267,0,0,1-.727-.6,5.061,5.061,0,0,1,0-7.16L21.738,7.1a5.063,5.063,0,1,1,7.114,7.2l-.92.92a1.132,1.132,0,0,0-.266,1.168,12.956,12.956,0,0,1,.681,3.707,1.124,1.124,0,0,0,1.919.746l2.609-2.609a10.7,10.7,0,0,0,0-15.114Z" transform="translate(0 0)" fill="#ccc"/>
    </svg>;
}

export const DoctorIcon : React.FC<Props> = ({ }) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="27" height="27" viewBox="0 0 27 27">
        <path id="Icon_awesome-plus-square" data-name="Icon awesome-plus-square" d="M24.107,2.25H2.893A2.894,2.894,0,0,0,0,5.143V26.357A2.894,2.894,0,0,0,2.893,29.25H24.107A2.894,2.894,0,0,0,27,26.357V5.143A2.894,2.894,0,0,0,24.107,2.25ZM22.179,17.438a.725.725,0,0,1-.723.723H15.911v5.545a.725.725,0,0,1-.723.723H11.813a.725.725,0,0,1-.723-.723V18.161H5.545a.725.725,0,0,1-.723-.723V14.063a.725.725,0,0,1,.723-.723h5.545V7.795a.725.725,0,0,1,.723-.723h3.375a.725.725,0,0,1,.723.723v5.545h5.545a.725.725,0,0,1,.723.723Z" transform="translate(0 -2.25)" fill="#ccc"/>
    </svg>

}

export const PasswordIcon : React.FC<Props> = ({className}) => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="19.81" height="26" viewBox="0 0 19.81 26">
        <path id="Icon_material-lock" data-name="Icon material-lock" d="M23.333,10.167H22.1V7.69a6.19,6.19,0,1,0-12.381,0v2.476H8.476A2.483,2.483,0,0,0,6,12.643V25.024A2.483,2.483,0,0,0,8.476,27.5H23.333a2.483,2.483,0,0,0,2.476-2.476V12.643A2.483,2.483,0,0,0,23.333,10.167ZM15.9,21.31a2.476,2.476,0,1,1,2.476-2.476A2.483,2.483,0,0,1,15.9,21.31Zm3.838-11.143H12.067V7.69a3.838,3.838,0,1,1,7.676,0Z" transform="translate(-6 -1.5)" fill="#ccc"/>
    </svg>
}

export const LogoutIcon : React.FC<Props> = ({className}) => {
    return <svg id="logout" xmlns="http://www.w3.org/2000/svg" width="26.835" height="26.746" viewBox="0 0 26.835 26.746">
        <g id="Сгруппировать_91" data-name="Сгруппировать 91" transform="translate(12.348 0)">
            <g id="Сгруппировать_90" data-name="Сгруппировать 90">
                <path id="Контур_97" data-name="Контур 97" d="M1.114,25.367h10.03a1.115,1.115,0,0,0,1.114-1.114V4.193a1.115,1.115,0,0,0-1.114-1.114H1.114a1.114,1.114,0,0,1,0-2.229h10.03a3.347,3.347,0,0,1,3.343,3.343v20.06A3.347,3.347,0,0,1,11.144,27.6H1.114a1.114,1.114,0,1,1,0-2.229Z" transform="translate(0 -0.85)" fill="#ff3b30"/>
            </g>
        </g>
        <g id="Сгруппировать_93" data-name="Сгруппировать 93" transform="translate(0 5.572)">
            <g id="Сгруппировать_92" data-name="Сгруппировать 92">
                <path id="Контур_98" data-name="Контур 98" d="M170.432,114.172l6.776-6.687a1.114,1.114,0,1,1,1.565,1.587l-4.842,4.779h12.975a1.114,1.114,0,0,1,0,2.229H173.93l4.842,4.779a1.114,1.114,0,1,1-1.565,1.587l-6.776-6.687a1.114,1.114,0,0,1,0-1.587Z" transform="translate(-170.1 -107.165)" fill="#ff3b30"/>
            </g>
        </g>
    </svg>;
}

export const IconClass : React.FC<Props> = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="26.413" height="23.111" viewBox="0 0 26.413 23.111">
        <path id="Icon_awesome-camera" data-name="Icon awesome-camera" d="M26.413,8.028V22.885a2.477,2.477,0,0,1-2.476,2.476H2.476A2.477,2.477,0,0,1,0,22.885V8.028A2.477,2.477,0,0,1,2.476,5.552h4.54l.635-1.7a2.473,2.473,0,0,1,2.316-1.6h6.474a2.473,2.473,0,0,1,2.316,1.6l.64,1.7h4.54A2.477,2.477,0,0,1,26.413,8.028ZM19.4,15.456a6.19,6.19,0,1,0-6.19,6.19A6.2,6.2,0,0,0,19.4,15.456Zm-1.651,0a4.54,4.54,0,1,1-4.54-4.54A4.546,4.546,0,0,1,17.746,15.456Z" transform="translate(0 -2.25)" fill="#fff"/>
    </svg>
}

export const NotFoundIcon : React.FC<Props> = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="179" height="150" viewBox="0 0 179 150">
        <g id="Сгруппировать_191"  transform="translate(-913 -455)">
            <ellipse id="Эллипс_44"  cx="89.5" cy="16" rx="89.5" ry="16" transform="translate(913 573)" fill="#f7f7f7"/>
            <path id="Контур_138"  d="M14178.086,1995l-20.562-26.3H14108v71.14Z" transform="translate(-13107 -1452)" fill="#aeb8c2"/>
            <path id="Контур_137" d="M14108,1995l20.563-26.3h49.523v71.14Z" transform="translate(-13174 -1452)" fill="#aeb8c2"/>
            <rect id="Прямоугольник_306" width="95" height="125" rx="5" transform="translate(955 455)" fill="#f5f5f7"/>
            <path id="Прямоугольник_304" d="M0,0H137a0,0,0,0,1,0,0V48a5,5,0,0,1-5,5H5a5,5,0,0,1-5-5V0A0,0,0,0,1,0,0Z" transform="translate(934 543)" fill="#dce0e6"/>
            <path id="Прямоугольник_305" d="M0,0H68a0,0,0,0,1,0,0V12A15,15,0,0,1,53,27H15A15,15,0,0,1,0,12V0A0,0,0,0,1,0,0Z" transform="translate(969 540)" fill="#f5f5f7"/>
            <rect id="Прямоугольник_307" width="69" height="38" rx="3" transform="translate(968 467)" fill="#dce0e6"/>
        </g>
    </svg>;
}

export const ChevronIcon: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="12.621" height="22.243" viewBox="0 0 12.621 22.243">
        <path id="Icon_feather-chevron-down" data-name="Icon feather-chevron-down" d="M0,9,9,0l9,9" transform="translate(11.121 2.121) rotate(90)" fill="none" stroke="#000" strokeLinecap="round" stroke-linejoin="round" strokeWidth="3" />
    </svg>
}

export const CloseIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="13.426" height="13.423" viewBox="0 0 13.426 13.423">
        <path id="Icon_ionic-ios-close" data-name="Icon ionic-ios-close" d="M19.589,18l4.8-4.8A1.124,1.124,0,0,0,22.8,11.616l-4.8,4.8-4.8-4.8A1.124,1.124,0,1,0,11.616,13.2l4.8,4.8-4.8,4.8A1.124,1.124,0,0,0,13.2,24.384l4.8-4.8,4.8,4.8A1.124,1.124,0,1,0,24.384,22.8Z" transform="translate(-11.285 -11.289)" fill="#fff" />
    </svg>
}

export const BackIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="35.858" height="13.501" viewBox="0 0 35.858 13.501">
        <path id="Icon_ionic-ios-arrow-round-back" d="M15.216,11.51a.919.919,0,0,1,.007,1.294l-4.268,4.282,31.879.007a.914.914,0,0,1,0,1.828l-31.879-.007L15.23,23.2a.925.925,0,0,1-.007,1.294.91.91,0,0,1-1.287-.007L8.142,18.647h0a1.026,1.026,0,0,1-.19-.288.872.872,0,0,1-.07-.352.916.916,0,0,1,.26-.64l5.794-5.836A.9.9,0,0,1,15.216,11.51Z" transform="translate(-7.882 -11.252)" fill="rgba(17,17,17,0.8)"/>
    </svg>;
}

export const FullStar: React.FC<{ fill: string, className?: string }> = ({ fill, className }: { fill: string, className?: string }) => {
    return <svg xmlns="http://www.w3.org/2000/svg" className={className} width="25" height="23.214" viewBox="0 0 25 23.214">
        <path id="Icon_ionic-ios-star" data-name="Icon ionic-ios-star" d="M26.3,11.411H18.093L15.6,3.967a.9.9,0,0,0-1.7,0l-2.494,7.444H3.143a.9.9,0,0,0-.893.893.656.656,0,0,0,.017.151.858.858,0,0,0,.374.631l6.747,4.754L6.8,25.367a.9.9,0,0,0,.307,1,.864.864,0,0,0,.5.218,1.094,1.094,0,0,0,.558-.2L14.75,21.7l6.585,4.693a1.046,1.046,0,0,0,.558.2.8.8,0,0,0,.5-.218.884.884,0,0,0,.307-1l-2.589-7.528,6.691-4.8.162-.14a.936.936,0,0,0,.29-.6A.945.945,0,0,0,26.3,11.411Z" transform="translate(-2.25 -3.375)" fill={fill} />
    </svg>

}

export const HalfStar: React.FC = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="25" height="23.214" viewBox="0 0 25 23.214">
        <path id="Icon_ionic-ios-star-half" data-name="Icon ionic-ios-star-half" d="M26.3,11.411H18.093L15.6,3.967a.9.9,0,0,0-1.7,0l-2.494,7.444H3.143a.9.9,0,0,0-.893.893.656.656,0,0,0,.017.151.858.858,0,0,0,.374.631l6.747,4.754L6.8,25.367a.9.9,0,0,0,.307,1,.864.864,0,0,0,.5.218,1.094,1.094,0,0,0,.558-.2L14.75,21.7l6.585,4.693a1.046,1.046,0,0,0,.558.2.8.8,0,0,0,.5-.218.884.884,0,0,0,.307-1l-2.589-7.528,6.691-4.8.162-.14a.936.936,0,0,0,.29-.6A.945.945,0,0,0,26.3,11.411Zm-2.645,1.964-4.453,3.2a1.567,1.567,0,0,0-.569,1.775l1.68,4.894a.224.224,0,0,1-.34.257l-4.319-3.08-.006-.006a2.081,2.081,0,0,1-.9-1.7V7.019a.109.109,0,0,1,.212-.033h0l1.652,4.922a1.56,1.56,0,0,0,1.479,1.066h5.43A.223.223,0,0,1,23.656,13.375Z" transform="translate(-2.25 -3.375)" fill="#30b9d6" />
    </svg>
}

export const SearchIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="30.621" height="30.621" viewBox="0 0 30.621 30.621">
        <g id="Icon_feather-search" data-name="Icon feather-search" transform="translate(-3 -3)">
            <path id="Контур_102" data-name="Контур 102" d="M28.5,16.5a12,12,0,1,1-12-12A12,12,0,0,1,28.5,16.5Z" fill="none" stroke="#000" strokeLinecap="round" strokeLinejoin="round" strokeWidth="3" />
            <path id="Контур_103" data-name="Контур 103" d="M31.5,31.5l-6.525-6.525" fill="none" stroke="#000" strokeLinecap="round" strokeLinejoin="round" strokeWidth="3" />
        </g>
    </svg>;
}

export const CaretteDown = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="12.5" height="7.091" viewBox="0 0 12.5 7.091">
        <path id="Icon_awesome-caret-down" data-name="Icon awesome-caret-down" d="M1.635,13.5H12.453a.839.839,0,0,1,.593,1.434L7.639,20.345a.842.842,0,0,1-1.19,0L1.042,14.934A.839.839,0,0,1,1.635,13.5Z" transform="translate(-0.794 -13.5)" fill="#fff" />
    </svg>
}

export const ChevronRight = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="9.811" height="18.121" viewBox="0 0 9.811 18.121">
        <path id="Icon_feather-chevron-right" d="M13.5,25l8-8-8-8" transform="translate(-12.439 -7.939)" fill="none" stroke="#ccc" strokeLinecap="round" strokeLinejoin="round" strokeWidth="1.5"/>
    </svg>
}

export const VkIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="37.876" height="22.5" viewBox="0 0 37.876 22.5">
        <path id="Icon_awesome-vk" data-name="Icon awesome-vk" d="M38.32,8.276c.26-.879,0-1.526-1.252-1.526H32.927a1.778,1.778,0,0,0-1.8,1.174A34.7,34.7,0,0,1,26.037,16.4c-.963.963-1.406,1.273-1.934,1.273-.26,0-.661-.309-.661-1.188V8.276c0-1.055-.3-1.526-1.167-1.526H15.764a1,1,0,0,0-1.055.949c0,1,1.491,1.23,1.645,4.043v6.1c0,1.336-.239,1.582-.766,1.582-1.406,0-4.823-5.161-6.848-11.067-.408-1.146-.809-1.61-1.87-1.61H2.728c-1.181,0-1.42.555-1.42,1.174,0,1.1,1.406,6.546,6.546,13.746,3.424,4.915,8.248,7.58,12.635,7.58,2.637,0,2.96-.591,2.96-1.61,0-4.7-.239-5.14,1.083-5.14.612,0,1.666.309,4.127,2.679,2.813,2.813,3.277,4.071,4.852,4.071h4.141c1.181,0,1.779-.591,1.434-1.758-.787-2.454-6.11-7.5-6.349-7.84-.612-.788-.436-1.139,0-1.842.007-.007,5.063-7.123,5.583-9.534Z" transform="translate(-1.308 -6.75)" fill="#30b9d6"/>
    </svg>
}

export const InstagramIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="31.518" height="31.511" viewBox="0 0 31.518 31.511">
        <path id="Icon_awesome-instagram" data-name="Icon awesome-instagram" d="M15.757,9.914a8.079,8.079,0,1,0,8.079,8.079A8.066,8.066,0,0,0,15.757,9.914Zm0,13.331a5.252,5.252,0,1,1,5.252-5.252,5.262,5.262,0,0,1-5.252,5.252ZM26.051,9.584A1.884,1.884,0,1,1,24.166,7.7,1.88,1.88,0,0,1,26.051,9.584ZM31.4,11.5a9.325,9.325,0,0,0-2.545-6.6,9.387,9.387,0,0,0-6.6-2.545c-2.6-.148-10.4-.148-13,0a9.373,9.373,0,0,0-6.6,2.538,9.356,9.356,0,0,0-2.545,6.6c-.148,2.6-.148,10.4,0,13a9.325,9.325,0,0,0,2.545,6.6,9.4,9.4,0,0,0,6.6,2.545c2.6.148,10.4.148,13,0a9.325,9.325,0,0,0,6.6-2.545,9.387,9.387,0,0,0,2.545-6.6c.148-2.6.148-10.392,0-12.994ZM28.041,27.281a5.318,5.318,0,0,1-3,3c-2.074.823-7,.633-9.288.633s-7.221.183-9.288-.633a5.318,5.318,0,0,1-3-3c-.823-2.074-.633-7-.633-9.288s-.183-7.221.633-9.288a5.318,5.318,0,0,1,3-3c2.074-.823,7-.633,9.288-.633s7.221-.183,9.288.633a5.318,5.318,0,0,1,3,3c.823,2.074.633,7,.633,9.288S28.863,25.214,28.041,27.281Z" transform="translate(0.005 -2.238)" fill="#30b9d6"/>
    </svg>
}

export const TelegramIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="31.497" height="26.415" viewBox="0 0 31.497 26.415">
        <path id="Icon_awesome-telegram-plane" data-name="Icon awesome-telegram-plane" d="M31.409,6.933,26.655,29.348c-.359,1.582-1.294,1.976-2.623,1.23l-7.242-5.337L13.3,28.6a1.819,1.819,0,0,1-1.455.71l.52-7.376L25.784,9.809c.584-.52-.127-.809-.907-.288L8.283,19.969,1.139,17.733c-1.554-.485-1.582-1.554.323-2.3L29.4,4.669c1.294-.485,2.426.288,2,2.264Z" transform="translate(-0.001 -4.528)" fill="#30b9d6"/>
    </svg>
}

export const WhatsAppIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="31.5" height="31.5" viewBox="0 0 31.5 31.5">
        <path id="Icon_awesome-whatsapp" data-name="Icon awesome-whatsapp" d="M26.782,6.827A15.614,15.614,0,0,0,2.215,25.664L0,33.75l8.276-2.173a15.562,15.562,0,0,0,7.46,1.9h.007A15.76,15.76,0,0,0,31.5,17.866,15.671,15.671,0,0,0,26.782,6.827ZM15.743,30.846a12.951,12.951,0,0,1-6.609-1.807l-.471-.281L3.755,30.045l1.308-4.788-.309-.492a13,13,0,1,1,24.11-6.9,13.119,13.119,0,0,1-13.12,12.98Zm7.116-9.717c-.387-.2-2.306-1.139-2.665-1.266s-.619-.2-.879.2-1.005,1.266-1.237,1.533-.457.3-.844.1a10.617,10.617,0,0,1-5.309-4.641c-.4-.689.4-.64,1.146-2.13a.723.723,0,0,0-.035-.682c-.1-.2-.879-2.116-1.2-2.9-.316-.759-.64-.654-.879-.668s-.485-.014-.745-.014a1.445,1.445,0,0,0-1.041.485A4.383,4.383,0,0,0,7.8,14.4a7.641,7.641,0,0,0,1.589,4.036c.2.26,2.749,4.2,6.666,5.892,2.475,1.069,3.445,1.16,4.683.977a4,4,0,0,0,2.63-1.856,3.262,3.262,0,0,0,.225-1.856C23.505,21.417,23.245,21.319,22.859,21.129Z" transform="translate(0 -2.25)" fill="#30b9d6"/>
    </svg>
}

export const ViberIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="29.392" height="30.996" viewBox="0 0 29.392 30.996">
        <path id="Icon_awesome-viber" data-name="Icon awesome-viber" d="M27,3.021c-.769-.708-3.88-2.966-10.817-3,0,0-8.178-.49-12.161,3.166-2.215,2.215-3,5.466-3.081,9.491S.759,24.249,8.028,26.295h.006l-.006,3.123s-.048,1.265.787,1.519c1,.315,1.6-.648,2.56-1.683.527-.569,1.253-1.4,1.8-2.04a28.127,28.127,0,0,0,9.231-.678c1-.327,6.689-1.053,7.609-8.6.956-7.784-.46-12.7-3.014-14.921Zm.841,14.352c-.781,6.3-5.387,6.695-6.235,6.967a26.024,26.024,0,0,1-7.942.678s-3.148,3.8-4.128,4.782c-.321.321-.672.291-.666-.345,0-.418.024-5.187.024-5.187h0C2.738,22.56,3.1,16.138,3.168,12.778s.7-6.114,2.579-7.966c3.372-3.057,10.314-2.6,10.314-2.6,5.865.024,8.674,1.792,9.328,2.385,2.161,1.852,3.263,6.283,2.458,12.778Zm-8.414-4.891a.391.391,0,0,1-.781.036,1.872,1.872,0,0,0-1.973-2.052.391.391,0,0,1,.042-.781A2.632,2.632,0,0,1,19.432,12.482Zm1.229.684c.061-2.566-1.544-4.576-4.588-4.8a.391.391,0,0,1,.054-.781,5.3,5.3,0,0,1,5.315,5.6.391.391,0,0,1-.781-.018Zm2.845.811a.39.39,0,0,1-.781.006C22.689,9.05,19.4,6.362,15.413,6.332a.39.39,0,0,1,0-.781C19.874,5.581,23.464,8.662,23.506,13.977Zm-.684,5.938v.012c-.654,1.15-1.876,2.421-3.135,2.016l-.012-.018a23.267,23.267,0,0,1-6.186-3.42,15.824,15.824,0,0,1-2.566-2.566,19.642,19.642,0,0,1-1.864-2.821A18.087,18.087,0,0,1,7.483,9.746C7.078,8.487,8.343,7.264,9.5,6.61h.012a1.1,1.1,0,0,1,1.447.236s.751.9,1.071,1.338c.3.412.708,1.071.92,1.441a1.264,1.264,0,0,1-.224,1.61L12,11.816a1.065,1.065,0,0,0-.321.847,7.579,7.579,0,0,0,5.1,5.1,1.065,1.065,0,0,0,.847-.321l.581-.726a1.264,1.264,0,0,1,1.61-.224,15.684,15.684,0,0,1,2.772,1.991,1.081,1.081,0,0,1,.23,1.429Z" transform="translate(-0.927 -0.003)" fill="#30b9d6"/>
    </svg>
}

export const MailIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="33.203" height="26.3" viewBox="0 0 33.203 26.3">
        <g id="Icon_feather-mail" data-name="Icon feather-mail" transform="translate(-1.398 -4.85)">
            <path id="Контур_120" data-name="Контур 120" d="M6,6H30a3.009,3.009,0,0,1,3,3V27a3.009,3.009,0,0,1-3,3H6a3.009,3.009,0,0,1-3-3V9A3.009,3.009,0,0,1,6,6Z" fill="none" stroke="#30b9d6" strokeLinecap="round" strokeLinejoin="round" strokeWidth="2.3"/>
            <path id="Контур_121" data-name="Контур 121" d="M33,9,18,19.5,3,9" fill="none" stroke="#30b9d6" strokeLinecap="round" strokeLinejoin="round" strokeWidth="2.3"/>
        </g>
    </svg>
}


export const BalanceIcon = () => {
    return <svg xmlns="http://www.w3.org/2000/svg" width="15.843" height="28" viewBox="0 0 15.843 28">
        <path id="Icon_metro-money" data-name="Icon metro-money" d="M19.22,18.716c-3.531-.918-4.667-1.859-4.667-3.337,0-1.7,1.563-2.886,4.2-2.886,2.769,0,3.8,1.322,3.889,3.267H26.08a6.193,6.193,0,0,0-4.993-5.927V6.427H16.42v3.36c-3.018.661-5.444,2.606-5.444,5.616,0,3.593,2.979,5.382,7.311,6.424,3.9.933,4.667,2.294,4.667,3.757,0,1.066-.754,2.777-4.2,2.777-3.2,0-4.472-1.439-4.636-3.267h-3.43c.194,3.407,2.738,5.312,5.732,5.958v3.376h4.667V31.082c3.026-.583,5.444-2.333,5.444-5.53,0-4.4-3.78-5.911-7.311-6.837Z" transform="translate(-10.688 -6.427)" fill="#cccccc"/>
    </svg>
}